Table of Contents
 Class PlateElements
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Data of plate elements
[Serializable]
[DataContract]
public class PlateElements
Inheritance
object
PlateElements
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PlateElements()
Constructor
public PlateElements()
 PlateElements(int)
Constructor
public PlateElements(int count)
Parameters
count int
Number of plate elements
Properties
 Elements
List of fem elements for plate UID
[DataMember]
public List<FemElement> Elements { get; set; }
Property Value
List<FemElement>
 PlateType
Type plate elements
public StructuralPlateType PlateType { get; set; }
Property Value
StructuralPlateType
 PlateUID
Plate UID
public int PlateUID { get; set; }
Property Value
int
 Edit this page